
#ifndef		__BASEOBJ_H__
#define	__BASEOBJ_H__

//****************************************************************************************
//
//	BaseObjクラス
//
//****************************************************************************************
class BaseObj
{
private:

public:
	//	初期化・解放
	BaseObj(void) {};
	virtual ~BaseObj(void) {};
	
	//	更新・描画
	virtual void	Update(void) {};
	virtual void	Render(void) {};
};

//****************************************************************************************
#endif // !__BASEOBJ_H__
