#include	"../IEX/iextreme.h"
#include	"system/System.h"

#include	"sceneTitile.h"

//****************************************************************************************
//
//	sceneTitleクラス
//
//****************************************************************************************

//-------------------------------------------------------------------------------------
//	初期化・解放
//-------------------------------------------------------------------------------------
	
	//	コンストラクタ
	sceneTitle::sceneTitle( void )
	{

	}

	//	デストラクタ
	sceneTitle::~sceneTitle( void )
	{

	}

	//	初期化
	bool sceneTitle::Initialize( void )
	{
		return true;
	}

//-------------------------------------------------------------------------------------
//	更新・描画
//-------------------------------------------------------------------------------------
	
	//	更新
	void sceneTitle::Update( void )
	{
		// フェードイン
		// オープニング演出
		// コマンド待ち
		if (1)
		{
			// レスポンス演出
		}
	}

	//	描画
	void sceneTitle::Render( void )
	{

	}
